

class Setting{
    constructor() {
        // 人物，以满月14被封印前和12年后，16岁时解开封印时年龄为标准，如果要封印前的年龄，其他人减去12岁
        // 人名：年龄，($顶级学院#普通学院)学院名称（出生年份|入学年龄|学院等级）

        this.person = `
            ~满月：14岁 -> 16岁             $天穹学院（500元年|9岁|13456）         月光剑术，风法术，水法术，暗黑法术，月光幻术  
            ~雪染：1岁 -> 13岁              无学院（513元年）                      冰雪秘术，冰雪幻术，治疗术
            ~龙琦：4岁 -> 16岁              无学院（510元年）                      大刀术，炎龙秘术     
            ~花舞：4岁 -> 16岁              $天道学院（493元年|10岁|1234556）      花秘术，花幻术
            ~墨尘：8岁 -> 20岁              #墨香学院（507元年|9岁|13456）         指挥战术
            ~云嫣儿：7岁 -> 19岁            #炎焱学院（507元年|10岁|123456）       炼丹术，治疗术，火法术
            ~洛雷：6岁 -> 18岁              $天道学院（506元年|11岁|123456）       弓箭术，雷法术
            ~陇北川：6岁 -> 18岁            $北冥学院（506元年|11岁|123456）       体术，符咒术    

            ~深空琳(小玥)：12岁 -> 24岁     无学院（498元年）                      月影剑术
            ~紫薰：18岁 -> 30岁             $青云学院（494元年|10岁|123456）       月影剑术
            ~楚阮柒(小柒)：11岁 -> 23岁     无学院（499元年）                      月影剑术

            ~雷鸣田：16岁 -> 28岁           $天穹学院（498元年|10岁|1234556）      雷法术                                        
            ~辉火：15岁 -> 27岁             $天穹学院（499元年|10岁|13456）        大刀术，不死秘术
            ~安慧：10岁 -> 22岁             $天穹学院（504元年|10岁|12）           紫瞳幻术

            ~雪依：20岁 -> 32岁             $天穹学院（495元年|10岁|123456）       冰雪秘术，治疗术
            ~雪玲奈：21岁 -> 33岁           $天穹学院（494元年|11岁|123456）       冰雪秘术

            ~林汐如：17岁 -> 29岁           $天穹学院（497元年|10岁|12334455）     治疗术
            ~风千水：17岁 -> 29岁           $天穹学院（497元年|11岁|134556）       水法术
            ~云游：17岁 -> 29岁             $天穹学院（498元年|10岁|1234556）      炼丹术，火法术

            ~龙战：20岁 -> 亡               $天穹学院（494元年|9岁|1456）          体术，金龙秘术
            ~龙牙：24岁 -> 亡               $炎焱学院（490元年|10岁|13456）        大刀术，炎龙秘术
            ~龙卫延：30岁 -> 亡             #龙冀学院（484元年|10岁|13456）        斧头术，青龙秘术
            ~聂无边：26岁 -> 38岁           #龙冀学院（488元年|10岁|13456）        镰刀术，血龙秘术，符咒术
            ~离修：19岁 -> 31岁             无学院（495元年）                      双刀术，影龙秘术
        `

        // 角色生平
        this.biography = `
            天下第一武斗五年举办一次，年龄限制18岁成年~29岁，一生只能参加一次
            第17届冠军龙战（20岁），第18届冠军，第19届冠军辉火（25岁），第20届冠军满月（19岁）

            满月4岁，父亲和族长等人离去外出作战，7岁族中巨变，母亲被带走满月10岁与初恋林汐如13岁在一起，11岁分离，13岁时与11岁的深空琳在一起

            满月9岁入学  	    	  1  3  4  5  6  			5年毕业，6级
            林汐如10岁入学		1  2  3  3  4  4  5  5			7年毕业，5级，最后一年因没考上6级，所以提前结业了
            风千水11岁入学		   1  3  4  5  5  6			    6年毕业，6级
            辉火10岁入学		      1  3  4  5  6  			5年毕业，6级
            雷鸣田10岁入学		   1  2  3  4  5  5  6			7年毕业，6级
            云游10岁入学		1  2  3  4  5  5  6	   		    7年毕业，6级
            烟雨雲10岁入学		   1  2  3  4  5  6			    6年毕业，6级
            雪依10岁入学	    1  2  3  4  5  6				6年毕业，6级
            雪玲奈11岁入学      1  2  3  4  5  6				6年毕业，6级

            龙战9岁入学          1  4  5  6					    4年毕业，6级（御龙族当代族长，上一代长老儿子，金龙血脉）
            龙牙10岁入学  1 3 4  5  6					        5年毕业，6级（炎焱顶级学院，父亲御龙上一代族长儿子，母亲炎焱国，妻子炎焱国，炎龙血脉）
            龙卫延10岁入学    1  3  4  5  6	 				    6年毕业，6级（小国龙冀学院，龙之谷普通学院，父母御龙族，青龙血脉）
            聂无边10岁入学    1  3  4  5  6	 				    5年毕业，6级（小国龙冀学院，父亲血族，母亲御龙族） 
            离修无学院，跟着父亲和族中的师父学习（父亲暗夜国暗影族，母亲御龙族，暗影龙血脉，师父是暗影族老族长，将暗影族的所有术法书籍交给了离修，离修将暗影族术法与御龙族术法结合自创影龙杀阵）
            龙琦无学院，炎龙血脉，认离修做师父，结合影龙杀阵自创出炎龙杀阵。

            御龙五人对外实力：龙战 > 龙牙 > 龙卫延 > 聂无边 > 离修     实际实力：离修 > 龙战  >  龙牙 > 聂无边  > 龙卫延

            满月10岁时，辉火11岁，安慧6岁， 雷鸣田12岁，林汐如13岁，风千水13岁，雪依16岁，离修15岁，深空琳8岁，  烟雨雲11岁，龙战16岁，龙牙20岁，龙卫延26岁，聂无边22岁
            满月14岁时，辉火15岁，安慧10岁，雷鸣田16岁，林汐如17岁，风千水17岁，雪依20岁，离修19岁，深空琳12岁，烟雨雲15岁，龙战20岁，龙牙24岁，龙卫延30岁，聂无边26岁，龙琦4岁，雪染1岁，花舞4岁，云嫣儿7岁
            12年后，满月在封印中，生理年龄自然增长2岁，3年后满月19岁参加天下第一武斗
            满月16岁时，辉火27岁，安慧22岁，雷鸣田28岁，林汐如29岁，风千水29岁，雪依32岁，离修31岁，深空琳24岁，烟雨雲27岁，雪染13岁，龙琦16岁，花舞16岁，墨尘21岁，云嫣儿19岁，陇北川18岁，洛雷18岁，安心4岁。

            满月团队
            满月（剑客，水风法），雪染（冰法，群体治疗，群体增益），龙琦（火大剑，战士），花舞（斥候通讯，群体干扰），墨尘（战术指挥），云嫣儿（炼丹治疗），洛雷（弓箭手），陇北川（格斗体术，岩系）
        `
    }
};
export default {
    name: 'setting',
    module: new Setting()
};














































