

class Setting{
    constructor() {
        // 国家
        this.country = `
            星辰大陆：
                五大国：天煌国（$天穹学院，$天道学院，#天明学院，法术），炎焱国（$炎焱学院，火，炼丹），蓬莱国（$蓬莱学院，兽，幻术），北冥国（$北冥学院，冰），东岳国（$青云学院，$灵霄学院，剑，‌体术）
                小国：武侯国（$武侯学院），暗夜国（#夜晖学院：暗魔族，暗影族），花卉国（幻术），龙元国（#龙冀学院：御龙族），冰月国（冰雪谷：雪女族，月牙谷：月光族），弓藏国（弓箭术），雨墨国（#墨香学院：神算族），
                    无极国（格斗族，体术），斗铠国（炼器术）
            乾坤大陆：
        `
         
        // 货币
        this.money = `
            货币：      
            功法难度对应货币   难度1~29     难度30~59  难度60~89  超过90为顶级术法
                普通人铜钱    初级术银币    中级术金币   高级术，顶级术灵石
                1000铜钱    =   1银币   =    0.1金币   =    0.0001灵石
        `
        // 功法分四类：（1~29难度）初级功法，（30~59难度）中级功法 ，（60~89难度）高级功法 ，（>=90难度）顶级功法 
        // 难度的评级，主要是在撰写过程中进行评出，主要由以下几个点
        // 1：灵力消耗、体力消耗；2：学习难度、知识体系；3、灵力要求、体质要求
        // 撰写府
        this.compose = `
            撰写府：国家所掌握的撰写部门，专门撰写功法书籍的。撰写时，需要撰写师撰写符印，然后精通该功法的人配合将灵力状态融入符印，方才能撰写出功法书籍
                撰写术需要对符咒术有一定的掌握，越是高级的撰写术，对符咒术的要求越高。而且只有极少数人放弃自身的战斗力，愿意去学习撰写术。而撰写师也往往都是老头。
                由于撰写一本书籍，必须要精通该功法的人（如果不精通该功法，撰写出来的书籍算半成品）一直陪在撰写师旁直到撰写结束方可离开，比较费时费力，所以一般都是年老的人去方才去将自己的功法录入进书籍
            国家撰写府，一般有几百名学徒，50名初阶撰写师，10名中阶撰写师，3名高阶撰写师
                撰写的书籍，通常需要撰写师对该功法有一定的理解，比如要撰写一套剑法书籍，需要撰写师对剑法有一定的理解。所以这也导致了难度越高的功法，越是稀有，甚至无法被撰写。
                由于大部分高级功法和顶级功法，有时候无法被撰写，掌握该功法的人，往往会自己去学习撰写术，自己花费几个月的时间将该功法撰写进书籍，留给后人以防功法失传。但这类往往市面上只有一本。
            初级功法：通常由10名以上初阶撰写师完成，1天撰写一本，通常要求最低撰写出10多本以上，周期10来天，然后本人一本，神殿藏书阁一本，各个学院一本，剩下留1本拍卖出流落到地方，价格在5银币~100银币之间
            中级功法：通常由5名以上中阶撰写师完成，2~3天撰写一本，通常要求最低撰写出5本以上，周期10来天，然后本人一本，神殿藏书阁一本，各个学院之间比斗冠军奖赏（本人学习后给学院），剩下留1本拍卖出流落到地方，
                价格在100金币~10000金币之间。
            高级功法：通常由3名以上高阶撰写师完成，需要几个国家高阶撰写师一起完成，5~10天撰写1本，通常要求撰写出2~3本，周期20来天，然后本人一本，剩下两本成为大陆所有学院比斗冠军奖励（本人学习后给学院）
                价格在100灵石~1万灵石之间
            顶级功法：通常由10多名高阶撰写师完成15天撰写1本，通常要求最低撰写出2本，周期30天，需要几个国家高阶撰写师一起完成。然后本人一本，剩下一本则是成为天下第一武斗第一名奖赏，价格在1万灵石以上甚至无价
        `
        // 器术
        this.weapon = `
            器术：（式：一种招式，法：一套功法）
            柳叶刀法一45（中级刀法）柳叶刀法二70（高级刀法）
            太极刀法一50（中级刀法）太极刀法二72（高级刀法） 
            断刀刀法一51（中级刀法）断刀刀法二75（高级刀法）
            月光剑法一56（中级剑法，月光族普通弟子），月光剑法中包含：半月斩35（中级剑式）空月斩50（中级剑式）
            月光剑法二85（高级剑法，族中长老和族长），月影剑法88（不分一，二。学习难度高，且对体质要求苛刻），月光剑法全包含：月无影65（高级剑式），月无崖76（高级剑式），月光领域83（高级剑式领域）
            斩无月：是满月结合自身法术和月光剑法自己创建的剑式，斩无月一式风月无边55（中级剑式） 斩无月二式水月镜花81（高级剑式，需结合月光领域） 斩无月三式93~97九天揽月（顶级剑式，结合月光领域或风花雪月领域） 
            光影神剑101（顶级剑式）需要深空琳的月影领域一起
            万剑归宗80（高级剑式）  御剑术58（中级剑式）
            暗影杀阵95（顶级刀式，需要结合领域） 焱龙杀阵93（顶级刀式，需要结合领域
        `
        // 法术
        this.magic‌ = `
            基础法术(一)（3）   基础法术(二)（12）  基础法术(三)（25）
            大火球术（36）天火流星（95）
            附魔术（35） 融合技法一（50）【包含附魔术】，融合技法二（80）【包含领域融合技法】
            传气术（20治疗法术） 风刃（8） 
        `
        // 体术
        this.martialArts = `
            基础体术(一)（3） 基础体术(二)（12）  基础体术(三)（25）
            铁砂掌（25）
            凌空步（42）
        `

        // 幻术（其中包含幻象术，领域术）
        this.illusion = `
            风花雪月93（顶级融合领域术）需要雪染的雪之领域一起
            初级幻化术（20） 中级幻化术（40）高级幻化术（60）分身术（75）
        `

        // 符咒术
        this.spell = `
            基础符咒术(一)（10）   基础符咒术(二)（25）
            撰写术(一)（30）撰写术(二)（60）撰写术(三)（90）进入撰写府所必学，分别撰写初，中，高级的书籍，学习撰写术可考进专门的撰写府，成为学徒
            传送咒印术（30）只能绑定一组传送阵
            空间封印术（32） 召唤术（31）
            高级传送咒印术（75）可以同时绑定多组传送阵，需要特殊体质
        `

        // 炼丹术
        this.alchemy = `
            一品聚灵丹20（初级炼丹术），二品聚灵丹38（中级炼丹术），三品聚灵丹65（高级炼丹术）。用来恢复灵力
            一品精血丹15（初级炼丹术），二品精血丹35（中级炼丹术），三补精血丹55（中级炼丹术）。用来恢复精血
            一品白骨生肉丹55（中级炼丹术），二品白骨生肉丹85（高级炼丹术）。用来加速恢复肉体
            一品淬体丹22（初级炼丹术），二品淬体丹48（中级炼丹术），三补淬体丹75（高级炼丹术）。用来辅助锻炼肉体
            一品生骨丹22（初级炼丹术），二品生骨丹48（中级炼丹术），三补生骨丹75（高级炼丹术）。用来辅助锻炼骨骼
            一品养神丹32（中级炼丹术），二品养神丹55（中级炼丹术），三补养神丹80（高级炼丹术）。用来辅助锻炼精神力
            一品幻灵丹32（中级炼丹术），二品幻灵丹55（中级炼丹术），三补幻灵丹80（高级炼丹术）。用来改变自己的相貌
            一品灵兽丹16（中级炼丹术），二品灵兽丹38（中级炼丹术）。用来喂养灵兽
            一品养颜丹50（中级炼丹术），二品养颜丹75（高级炼丹术）。用来美容
            各种毒丹，解毒丹（分低中高级，但不分品阶，毒药不是丹）
        `

        // 炼器术
        this.spagyric = `
            基础炼器术（30）
            卸灵甲（25）使用金币或者银币参入，进行打造
        `

        // 学院
        this.school = `
            学院6级 8年制
            顶级学院招生年龄不超过12岁，普通学员不超过15岁，顶级学院只接收治疗和炼丹特殊系，而不接收炼器师，因炼器师大多为炼制普通的飞刀，大剑，盔甲等，顶级炼器师稀有往往是只在炼器师家族延续。
            所以大部分炼器师，都是在炼器坊学习，而炼丹和治疗系，虽然也有在家族延续，但这两个职业人数要稍微多一些，学院也普遍具备炼丹老师。
            从特殊系地位来看，如果是顶级的话，炼器师 >  炼丹师 = 治疗系，如果是低中端的话：炼丹师 > 治疗系 > 炼器师 
            外院藏书阁，包含大量初级和少量中级功法，内院藏书阁，包含大量中级功法和少量高级功法。需要花费平时积攒的学分进行借阅，

            向上考核失败3次则直接按该等级毕业
            有一次跳级机会，完成上一次考核后，进行下一学级的考核，成功后跳级成功，但失败则返回原始等级（满月辉火1跳3后遇到雷鸣田5年毕业，龙战1跳4级4年毕业）

            （满月这届有6人毕业，满月，辉火，风千水（2次考核成功），1名炼丹师（非炼丹世家云游15岁，2次考核成功，天才炼丹妹妹云嫣儿7岁的哥哥），1名擅长符印术战斗的女生（3次考核成功），1名治疗师（2次考核成功）
            内院高阶(紫6)  5人		    无考核，但中期会为学院参加整个大陆所有顶级学院的单人比斗，普通学院6级在上一次考核中表现成绩优异者可参与，（治疗系和炼丹系单独比斗）
            内院中阶(蓝5)  50人		    5考6，天煌国内所有学院的内院中阶生进行两场比斗，第一场为团队赛，在秘境中进行灵药采集自行组队（治疗系炼丹系单独考核），选出前64名后，进行第二场为1v1抽签武斗
                            （治疗系和炼丹系单独比斗）顶级学院前16名算考核成功进入内院高阶，普通学院前64名可进入内院高阶。同时前16名可以参与下一年内院高阶的大陆所有学院的比斗。
            内院初阶(黄4)  200人	    4考5，内院后山灵药采集1天1夜天自行组队（治疗系一起参与，炼丹系单独考核）只有前240名晋升4学级（前50名可从自己采集的灵药中挑选一株，前10两株）
            外院高阶(紫3)  700人	    3考4，难度加大，外院前山令牌抢夺1天1夜自行组队，满月与初恋在一起（治疗系一起参与，炼丹系单独考核）
            外院中阶(蓝2)  800人 	    2考3，实战考核，在一个圈内进行团队混战，出圈外算淘汰。淘汰35%左右人数算结束。（治疗系炼丹系单独考核）
            外院初阶(黄1)  600人        1考2，理论+各项能力测验（包括飞刀，力量，体魄，基础法术，基础咒印等）治疗系和炼丹系的考核合格分数线有所降低，同时会单独考核治疗和炼丹方面的测验

            每年招收500人左右，每年总在校生2500人左右，外院2300人，内院200多人			每年毕业400人左右（外内院占比3:1），每年死亡或重伤100人左右
            外院初阶(黄)  500+100+0   		上年考核失败100人 	上上年考核失败无	600人		晋升率80%        死亡率+重伤率1% 	    每年毕业1~3人		30人一个班
            外院中阶(蓝)  500+180+120   	上年考核失败180人  	上上年120人        	800人		晋升率65%        死亡率+重伤率6%   	    每年毕业80人		30人一个班
            外院高阶(紫)  320+230+150   	上年考核失败230人  	上上年150人        	700人		晋升率28%        死亡率+重伤率10%       每年毕业190人		30人一个班
            内院初阶(黄)  90+70+40   		上年考核失败70人  	上上年40人        	200人		晋升率15%        死亡率+重伤率15%     	每年毕业100人		20人一个班	
            内院中阶(蓝)  20+20+10	  	    上年考核失败20人  	上上年10人        	50人		晋升率5%         死亡率+重伤率8% 	    每年毕业30人		10人一个班	
            内院高阶(紫)  1+2+2	  	        5人晋级  				5人	    		         死亡率+重伤率5%	每年毕业5人左右		    一个班

        `

        // 战力
        this.combatPower = `
            大国顶级学院1~2个，小国0个（武侯国1个除外）	大国普通学院10个，小国1~2个，每年招收300人左右
            入选考核	需要普通兵入门实力			        1级（地方村镇兵种）
            1，   	    毕业时为普通兵中翘楚		        2级（地方村镇兵种）
            2，3级      毕业时为精兵实力			        3，4级（城池兵种）
            4级	        毕业时为副队长实力			        5级（管理10个精兵）
            5级   	    毕业时大队长实力			        6级（管理3个副队长）
            6级	        毕业时为普通将领实力 = 神殿护卫		（管理5个大队长）	        14岁满月	
                        高级将领 = 神殿暗卫，乾坤大陆外圈层城主		                    16岁满月，16岁龙琦，13岁深空琳
                        统帅 = 神殿亲卫，乾坤大陆中圈层高级部下		                    17岁满月，18岁龙琦
                        神殿十侍，乾坤大陆中圈层城主				                   18岁满月，20岁龙琦，31岁雷鸣田
                        神殿十侍之首，乾坤大陆内圈层高级部下，乾坤大陆十大魔兽	         19岁满月，21岁龙琦，20岁深空琳
                        神殿御主，乾坤大陆内圈层城主，乾坤大陆三大魔兽		            20岁满月，24岁深空琳，30岁辉火，20岁龙战，19岁离修，22岁龙琦
                        神殿太上长老，乾坤大陆八御主				                   21岁满月，27岁深空琳，炎焱太上长老火神天师
                        乾坤大陆三神王					                              23岁满月，31岁离修
                        乾坤大陆巅峰					                              25岁满月
                        武侯国无名魔兽					                              30岁暗夜主，35岁流云


                1000普通兵 = 200精兵 = 50副队长 = 30个大队长 = 15个普通将领 = 8个高级将领 = 5个统帅 
                        = 3神殿十侍 = 1.5神殿十侍之首 =  1神殿御主 = 0.8个神殿长老 = 0.5乾坤大陆三神王 = 0.2乾坤大陆巅峰 = 0.1武侯国无名魔兽
        `
    }
};
export default {
    name: 'setting',
    module: new Setting()
};














































